app/Controllers/Dashboard.php

    public function index()
    {
        $model = new EmployeeModel();

        $provinceCounts = $model
            ->select('province, COUNT(*) as total')
            ->groupBy('province')
            ->findAll();

        $positionCounts = $model
            ->select('plantilla_position, COUNT(*) as total')
            ->groupBy('plantilla_position')
            ->findAll();

        // *** NEW: gender counts ***
        $genderRaw = $model
            ->select('gender, COUNT(*) as total')
            ->groupBy('gender')
            ->findAll();
---
SELECT `province`, COUNT(*) as total
FROM `employees`
GROUP BY `province`
SELECT `plantilla_position`, COUNT(*) as total
FROM `employees`
GROUP BY `plantilla_position`
SELECT `gender`, COUNT(*) as total
FROM `employees`
GROUP BY `gender`