app/Controllers/Employee.php

    public function index(): string
    {
        $model = new EmployeeModel();
        $data['employees'] = $model->findAll();
---
SELECT *
FROM `employees`

    public function directory()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('employees')
            ->select('*')
            ->orderBy('last_name')
            ->orderBy('first_name');

        $data = [
            'provinces'     => $db->table('employees')->select('province')->distinct()->orderBy('province')->get()->getResultArray(),
            'municipalities'=> $db->table('employees')->select('municipality')->distinct()->orderBy('municipality')->get()->getResultArray(),
            'positions'     => $db->table('employees')->select('plantilla_position')->distinct()->orderBy('plantilla_position')->get()->getResultArray(),
            'designations'  => $db->table('employees')->select('designation')->distinct()->orderBy('designation')->get()->getResultArray(),
        ];

        foreach (['province', 'municipality', 'plantilla_position', 'designation'] as $key) {
            if ($this->request->getGet($key)) {
                $builder->where($key, $this->request->getGet($key));
            }
        }

        $data['employees'] = $builder->get()->getResultArray();
---
SELECT DISTINCT `province`
FROM `employees`
ORDER BY `province`
SELECT DISTINCT `municipality`
FROM `employees`
ORDER BY `municipality`
SELECT DISTINCT `plantilla_position`
FROM `employees`
ORDER BY `plantilla_position`
SELECT DISTINCT `designation`
FROM `employees`
ORDER BY `designation`
SELECT *
FROM `employees`
ORDER BY `last_name`, `first_name`