app/Controllers/QrrpaController.php

    public function summary()
    {
        $monitoringModel = new \App\Models\QrrpaMonitoringModel();
        $locationModel = new \App\Models\LocationModel();

        $monitoringData = $monitoringModel->findAll();
---
SELECT *
FROM `qrrpa_monitoring`