app/Models/LocationModel.php

    public function getProvinces()
    {
        return $this->db->table('provinces')->orderBy('name')->get()->getResultArray();
---
SELECT *
FROM `provinces`
ORDER BY `name`

    public function getMunicipalities()
    {
        return $this->db->table('municipalities')->orderBy('name')->get()->getResultArray();
---
SELECT *
FROM `municipalities`
ORDER BY `name`