app/Models/QrrpaMonitoringModel.php

SELECT *
FROM `qrrpa_monitoring`
WHERE `year` = '2025'
AND `quarter` = 3
---
    public function getMonitoringStatus($year, $quarter)
    {
        return $this->where('year', $year)
                    ->where('quarter', $quarter)
                    ->findAll();