app/Models/Smv_model.php

    public function calculateLocationProgress($locationId)
    {
        $totalActivities = $this->db->table('activities')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `activities`

    public function getLocationActivities($locationId)
    {
        return $this->db->table('location_activities')
            ->select('location_activities.id, activities.name AS activity, location_activities.status, location_activities.date_completed, location_activities.remarks')
            ->join('activities', 'activities.id = location_activities.activity_id')
            ->where('location_activities.location_id', $locationId)
            ->orderBy('activities.category_id', 'ASC')
            ->orderBy('activities.id', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `location_activities`.`id`, `activities`.`name` AS `activity`, `location_activities`.`status`, `location_activities`.`date_completed`, `location_activities`.`remarks`
FROM `location_activities`
JOIN `activities` ON `activities`.`id` = `location_activities`.`activity_id`
WHERE `location_activities`.`location_id` = '1'
ORDER BY `activities`.`category_id` ASC, `activities`.`id` ASC

    public function getAllLocations()
    {
        return $this->db->table('locations')
            ->select('id, name, type, province_id')
            ->get()
            ->getResultArray();
---
SELECT `id`, `name`, `type`, `province_id`
FROM `locations`